SPECIAL_MEMBER_ROLES = (
    "车主",
    "画师",
    "章稿画师",
    "供稿人",
    "工具人",
)

SINGLE_PERSON_ROLES = frozenset(
    {
        "车主",
        "画师",
        "章稿画师",
        "供稿人",
    }
)

MULTI_PERSON_ROLES = frozenset(
    {
        "工具人",
    }
)

# 支持别名和可能的输入法错误识别
SPECIAL_MEMBER_ROLE_ALIASES = {
    "车主": "车主",
    "开车": "车主",

    "画手": "画师",
    "画师": "画师",
    "作画": "画师",
    "原画": "画师",
    "原作": "画师",
    "授权": "画师",
    "花式": "画师",
    "画室": "画师",

    "章稿画师": "章稿画师",
    "章稿": "章稿画师",
    "改稿": "章稿画师",

    "供稿人": "供稿人",
    "供稿": "供稿人",
    "稿主": "供稿人",

    "工具人": "工具人",
    "工具猫": "工具人",
    "工具": "工具人",
    "助手": "工具人",
    "管理": "工具人",
}